# -- Бот ------------------------------------------------------
TOKEN = ''

# -- Буфферный канал ------------------------------------------
BUFFER_CHAT_ID = -1001629929955

# -- Тексты бота ----------------------------------------------
_TEXT_MAIN_MENU = 'Привет! Все мы заядлые пользователи соцсетей, однако самые популярные из них сейчас' \
                  ' оказались частично заблокированными на территории РФ. Многие пользователи, ' \
                  'на которых вы долгое время были подписаны, плавно перетекли в телеграм, и теперь ' \
                  'количество ваших подписок на тг-каналы выросло. Чтение каналов тяжело ' \
                  'систематизировать, а большинство пользователей соцсетей уже привыкли к имеющейся ' \
                  'везде новостной ленте, которой так не хватает телеграму. ' \
                  'Мы решили исправить эту проблему, поэтому представляем вашему вниманию бота, ' \
                  'который поможет вам организовать новостную ленту из каналов, которые вы постоянно ' \
                  'читаете. Чтобы узнать о работе бота и запустить ленту, кликайте на кнопки снизу.'

_TEXT_BOT_INFORMATION = 'Данный бот помогает вам сделать собственную новостную ленту в телеграме. собирает сообщения ' \
                        'из добавленных вами телеграм-каналов для формирования аналога фида, как в других ' \
                        'социальных сетях (инстаграм, твиттер). Внутренний интерфейс бота предполагает выбор ' \
                        'каналов для подписки и управление ими. Бот автоматически присылает новые сообщения из ' \
                        'каналов из списка в хронологическом порядке. Бот бесплатный для вас, однако в ближайшее ' \
                        'время мы планируем запустить в нем рекламу.'

_TEXT_CHANGE_SUBSCRIPTIONS = 'Настройки подписок'

_TEXT_SET_INTERESTS = 'Настройки интересов. Ваши настройки:\n' \
                      '<b>ID: </b>TELEGRAM_ID\n' \
                      '<b>Пол: </b>SEX\n' \
                      '<b>Возраст: </b>AGE г.р.\n' \
                      '<b>Город: </b>ADDRESS\n' \
                      '<b>IS_LISTENING</b>'

_TEXT_DEFAULT = 'Жду от вас указаний'

_TEXT_SET_SEX = 'Ваш пол?'

_TEXT_SET_AGE = 'Введите год рождения.'

_TEXT_SET_ADDRESS = 'Введите город, где вы проживаете.'

_TEXT_OK = 'OK'

_TEXT_INPUT_CHANNEL_NAME = 'Введите название канала через @'

_TEXT_YOU_SUBSCRIPTION_IN_CHANNEL = 'В подписаны на канал <b>«TITLE»</b>'

_TEXT_YOU_SUBSCRIPTION_IN_NEW_CHANNEL = 'В подписались на канал <b>«TITLE»</b>'

_TEXT_YOU_SUBSCRIPTIONS = 'Ваши подписки:'

_TEXT_FEED_STARTED = 'Лента запущена'

_TEXT_FEED_STOP = 'Лента остановлена'

_TEXT_ERROR_CHANNEL = 'Ошибка в названии канала'

_TEXT_NOT_CHANNELS = 'У вас пока нет каналов'

# -- Кнопки --------------------------------------------------------------
_CHANGE_SUBSCRIPTIONS = 'Изменить подписки'
_CHANGE_INTERESTS = 'Изменить интересы'
_BOT_INFORMATION = 'О боте'
_START_FEED = 'Запустить ленту'
_STOP_FEED = 'Остановить ленту'
_WRITE_A_FEEDBACK = 'Оставить отзыв о боте'

_ADD_CHANNEL = 'Добавить канал'
_CHANGE_CHANNELS = 'Изменить каналы'
_CONFIRM = 'Готово'

_SEX = 'Пол'
_AGE = 'Возраст'
_ADDRESS = 'Город проживания'
